package stepdefinitions;

import io.cucumber.java.en.*;

public class CityChangeSteps {
    @When("Нажимаем на кнопку смены города")
    public void нажимаемНаКнопкуСменыГорода() {
    }

    @And("Выбираем первый адрес из списка адресов")
    public void выбираемПервыйАдресИзСпискаАдресов() {
    }

    @Then("Произошел переход на домашнюю страницу")
    public void произошелПереходНаДомашнююСтраницу() {
    }

    @And("На странице присутствует адрес выбранного пункта выдачи")
    public void наСтраницеПрисутствуетАдресВыбранногоПунктаВыдачи() {
    }
}
